[
    {
        "type": "Feature",
        "frontend": true,
        "task": "Einführung eines neuen Dashboards für die Nutzer:innen.",
        "consequence": "Das neue Dashboard ist intuitiver und ermöglicht eine effizientere Nutzung des Produkts.",
        "effect": "Die Nutzer:innen sind zufriedener und benötigen weniger Support. Ihr habt dauerhaft 1 Storypoint mehr.",
        "cost": 2,
        "techDebt": 0,
        "positive": true,
        "effectType": "addPermanent",
        "effectAmount": 1
    },
    {
        "type": "Feature",
        "frontend": true,
        "task": "Entwicklung einer Gamification Funktion in eurem UI, um die Kunden mehr zu binden.",
        "consequence": "Ihr hättet die Gamification nicht auf Zufall basieren lassen sollen, jetzt habt ihr Stress mit der Polizei wegen illegalem Glückspiel. (Vielleicht solltet ihr nach Schleswig Holstein ziehen?)",
        "effect": "Das Verfahren bindet wichtige Ressourcen des Teams. Ihr habt 2 Storypoints weniger in der nächsten Runde.",
        "cost": 1,
        "techDebt": 0,
        "positive": false,
        "effectType": "removeTemporary",
        "effectAmount": 2
    },
    {
        "type": "Feature",
        "frontend": true,
        "task": "Erstellen einer guten Dokumentation für euer Produkt.",
        "consequence": "Kunden verstehen jetzt actually wie sie euer Produkt schnell und simpel benutzen können und schreiben nicht zig Emails.",
        "effect": "Durch die wegfallenden Emails seid ihr massiv entlastet und könnt euch auf die Entwicklung konzentrieren. Ihr bekommt dauerhaft 4 Storypoints mehr.",
        "cost": 1,
        "techDebt": 2,
        "positive": true,
        "effectType": "addPermanent",
        "effectAmount": 4
    },
    {
        "type": "Feature",
        "frontend": true,
        "task": "David der Designer hat eine neue UI entworfen, um eure Revenue zu boosten. Implementiert die neue UI.",
        "consequence": "Das neue UI zieht zahlreiche Kund:innen an, umso mehr Personen denen Bugs auffallen.",
        "effect": "Bei 2 Bugs seid ihr euch sehr sicher, dass es nicht ERROR-40 ist und solltet diese schleunigst beheben.",
        "cost": 2,
        "techDebt": 0,
        "positive": false,
        "effectType": "newBug",
        "effectAmount": 2
    },
    {
        "type": "Feature",
        "frontend": true,
        "task": "Integration von Social Media Sharing Buttons.",
        "consequence": "Die Buttons sind so prominent platziert, dass Nutzer:innen aus Versehen ihr ganzes Konto auf Social Media teilen. Es gibt viele Beschwerden",
        "effect": "Ihr müsst die Buttons besser platzieren und euch mit den anderen Beschwerden beschäftigen. Im Beschwerde-Wahn haben Nutzende nämlich auch einige andere Bugs gemeldet.",
        "cost": 2,
        "techDebt": 0,
        "positive": false,
        "effectType": "newBug",
        "effectAmount": 2
    },
    {
        "type": "Feature",
        "frontend": false,
        "task": "Um in Zukunft viele, gute und diverse Daten in eurer Datenbank speichern zu können müsst ihr diese aktualisieren.",
        "consequence": "Ihr habt erfolgreich eure Datenbank geupdated und seid bereit für KI! Jetzt noch schneller.",
        "effect": "Durch weniger Workarounds spart ihr wichtige Zeit. Für einen KI-Sprint habt ihr einen Storypoint mehr",
        "cost": 2,
        "techDebt": 2,
        "positive": true,
        "effectType": "addTemporary",
        "effectAmount": 1
    },
    {
        "type": "Feature",
        "frontend": false,
        "task": "Entwicklung einer neuen API für eure Kunden, um den Faxverkehr zu verringern.",
        "consequence": "Die Kunden nehmen die neue Technologie sehr erfreut auf und haben zahlreiche Ideen wie sie noch verbessert werden kann.", 
        "effect": "Euch werden viele neue User Storys präsentiert. Eine davon soll direkt umgesetzt werden.",
        "cost": 3,
        "techDebt": 0,
        "positive": true,
        "effectType": "newFeature",
        "effectAmount": 1
    },
    {
        "type": "Feature",
        "frontend": false,
        "task": "Implementierung eines neuen Sicherheitsfeatures.",
        "consequence": "Das neue Feature ist so sicher, dass sogar das Entwicklerteam keinen Zugriff mehr hat. Erstmal muss ein Teil eures Teams Cycbersecurity belegen.",
        "effect": "Ihr müsst die Zugangsrechte neu verteilen und verliert wertvolle Zeit. Eine Person ist zu gestresst durch Cybersecurity, wandert nach Nepal aus und schickt euch eine Postkarte, die euch Meditation empfiehlt. Immer mehr Teammitglieder führen Yogapausen ein. Euch fehlen dauerhaft 2 Storypoints.",
        "cost": 1,
        "techDebt": 2,
        "positive": false,
        "effectType": "removePermanent",
        "effectAmount": 2
    },
    {
        "type": "Feature",
        "frontend": false,
        "task": "Architektur-Redesign ist fällig",
        "consequence": "Chief of Technology hat euch immer häufiger darauf hingewiesen, dass ihr endlich mal die Architektur neu strukturieren müsst, bevor ihr zu viel Technical Debt aufgebaut habt. Ihr habt euch der Challenge endlich gestellt.",
        "effect": "Ihr habt eure Skills aus SWA ausgebessert und seid auch in Zukunft selbstbewusster darin, gute Architekturentschiedungen zu treffen. Es gibt einen Storypoint mehr für den nächsten Sprint.",
        "cost": 2,
        "techDebt": 2,
        "positive": true,
        "effectType": "addPermanent",
        "effectAmount": 1
    },
    {
        "type": "Feature",
        "frontend": false,
        "task": "Automatisierung des Deployments einführen.",
        "consequence": "Durch die Automatisierung habt ihr endlich weniger manuelle Arbeit, aber der CI-Server ist jetzt öfter down als up.",
        "effect": "Ihr spart langfristig Zeit, aber der CI-Server kostet euch für den nächsten Sprint 1 Storypoint.",
        "cost": 3,
        "techDebt": 1,
        "positive": true,
        "effectType": "removeTemporary",
        "effectAmount": 1
    },
    {
        "type": "Feature",
        "frontend": true,
        "task": "Einführung einer Chatbot-Funktion für den Kundensupport.",
        "consequence": "Der Chatbot verwechselt oft Anfragen und bestellt Pizza, statt Tickets zu erstellen.",
        "effect": "Ihr bekommt viele kostenlose Pizzen, aber müsst den Chatbot dringend verbessern. Die überlesenen Bugs müssen nun alle möglichst bald behoben werden.",
        "cost": 2,
        "techDebt": 1,
        "positive": false,
        "effectType": "newBug",
        "effectAmount": 3
    },
    {
        "type": "Feature",
        "frontend": true,
        "task": "Buntere Knöpfe und Slider",
        "consequence": "Nach einem Gespräch mit dem Design Team sollt ihr mehr Farben einbringen und möglichst viel von den Nutzenden selbst einstellen lassen, da sie dann psychologisch nachgewiesen mehr Spaß haben.",
        "effect": "Ihr lasst euch von ChatGPT Farbentemplates generieren und habt früher Feierabend. Dadurch habt ihr auch im nächsten Sprint mehr Energie. Es gibt temporär zwei Storypoints mehr.",
        "cost": 1,
        "techDebt": 2,
        "positive": true,
        "effectType": "addTemporary",
        "effectAmount": 2
    },
    {
        "type": "Feature",
        "frontend": false,
        "task": "Einbindung der Spotify API in euer Projekt.",
        "consequence": "Eure Kunden waren unbedingt für mehr Musik und Party im Projekt, egal was ihr eigentlich gerade macht.",
        "effect": "Ihr verliert Zeit durch spontane Partys im Büro und außerdem hat eine Person im Team ihren Job an den Nagel gehangen und wird jetzt DJ. Ihr habt dauerhaft einen Storypoint weniger.",
        "cost": 1,
        "techDebt": 0,
        "positive": false,
        "effectType": "removePermanent",
        "effectAmount": 1
    },
    {
        "type": "Feature",
        "frontend": true,
        "task": "Dark Mode für eure Anwendung implementieren.",
        "consequence": "Der Dark Mode ist so beliebt, dass eure Nutzer:innen nicht mehr schlafen und ständig Support-Anfragen stellen.",
        "effect": "Ihr müsst Überstunden machen, um alle Anfragen zu bearbeiten, habt im nächsten Sprint 3 Storypoints weniger.",
        "cost": 2,
        "techDebt": 1,
        "positive": false,
        "effectType": "removeTemporary",
        "effectAmount": 3
    },
    {
        "type": "Feature",
        "frontend": false,
        "task": "Kunden wünschen sich Jira Board, Slack und Time Tracker.",
        "consequence": "Nachdem ihr euch alle zum ersten Mal seriöse Email-Adressen angelegt habt und euch auf allen Plattformen mit den Kunden zusammen angemeldet habt, könnt ihr endlich anfangen zu arbeiten.",
        "effect": "Es gibt ganz viele Wünsche, die ihr erst mal schätzen und dann möglichst schnell bearbeiten müsst.",
        "cost": 2,
        "techDebt": 0,
        "positive": false,
        "effectType": "newFeature",
        "effectAmount": 1
    },
    {
        "type": "Bug",
        "frontend": false,
        "task": "Eure Backup-Routine hat seit Monaten keine Backups gemacht.",
        "consequence": "Zum Glück gab es keine Datenverluste, aber ihr müsst die Backup-Skripte überarbeiten.",
        "effect": "Ihr verbringt den nächsten Sprint mit der Sicherstellung der Backup-Routine und habt 2 Storypoints weniger.",
        "cost": 2,
        "techDebt": 2,
        "positive": false,
        "effectType": "removeTemporary",
        "effectAmount": 2
    },
    {
        "type": "Bug",
        "frontend": true,
        "task": "Eure UI funktioniert nicht auf mobilen Endgeräten. Euch gehen die Nutzer flöten, weil euer Produkt keine große Bildschirm-Task ist.",
        "consequence": "Eure Website funktioniert jetzt endlich auf mobilen Endgeräten, damit können eure Kunden nun auch aus dem Bad eure Produkte shoppen. Sales ist begeistert, ihr bekommt alle einen zusätzlichen Urlaubstag für den nächsten Sprint.",
        "effect": "Durch den zusätzlichen Urlaubstag fällt ein produktiver Tag für den Kapitalismus weg, ihr habt im nächsten Sprint zwei Storypoints weniger.",
        "cost": 2,
        "techDebt": 1,
        "positive": false,
        "effectType": "removeTemporary",
        "effectAmount": 2
    },
    {
        "type": "Bug",
        "frontend": false,
        "task": "Du hast Assembler Code im Core eures Projektes gefunden.",
        "consequence": "Du hast ein Panik-Meeting einberufen und ihr habt euch alle zähneklappernd den Code angeschaut. Zum Glück sind es nur ein paar Files, die nicht mehr verwendet werden und daher gelöscht werden können.",
        "effect": "Ihr seid alle total erleichtert und könnt die nächste Woche, die ihr in euren Kalendern für diesen Bug schon geblockt hattet, doch wieder frei halten. Das Team hat für den nächsten Sprint einen Storypoint mehr.",
        "cost": 2,
        "techDebt": 0,
        "positive": true,
        "effectType": "addTemporary",
        "effectAmount": 1
    },
    {
        "type": "Bug",
        "frontend": true,
        "task": "Beim Login können Nutzende den Beispielnamen ,Christoph Meinel´ nicht ändern. Es gibt viele verwirrte Beschwerden.",
        "consequence": "Das Team ist peinlich berührt, dass niemand diesen Fehler übersehen hat. Das Beispiel-Passwort ,Design Sinking` bringt euch alle zum Lachen.",
        "effect": "Zum Glück ist der Bug nicht schwierig zu fixen, aber dabei findet ihr leider noch weitere Bugs.",
        "cost": 1,
        "techDebt": 1,
        "positive": false,
        "effectType": "newBug",
        "effectAmount": 2
    },
    {
        "type": "Bug",
        "frontend": true,
        "task": "Die Suchfunktion auf eurer Website gibt immer 'Kein Ergebnis' zurück.",
        "consequence": "Die Nutzer:innen sind verwirrt und wenden sich an den Support. Ihr merkt, dass die Suchdatenbank nur Memes über die Enten im Lake HPI beinhaltet und daher niemals sinnvolle Ergebnisse zurückgibt.",
        "effect": "Nachdem ihr die Datenbank mit sinnvollen Inhalten gefüllt habt, funktioniert alles wieder, aber der Support ist genervt und ihr verliert temporär 1 Storypoint.",
        "cost": 1,
        "techDebt": 1,
        "positive": false,
        "effectType": "removeTemporary",
        "effectAmount": 1
    },
    {
        "type": "Bug",
        "frontend": true,
        "task": "Rechtsruck eurer Website. Passt das Alignment wieder an.",
        "consequence": "Eure Website verliert an Aufrufen gewisser Personengruppen, gewinnt dafür bei anderen.",
        "effect": "Summasumarum passts!",
        "cost": 1,
        "techDebt": 0,
        "positive": true,
        "effectType": "addTemporary",
        "effectAmount": 0
    },
    {
        "type": "Bug",
        "frontend": false,
        "task": "Euer Produkt stürzt ab, wenn man auf zwei Geräten mit dem gleichen Account angemeldet ist.",
        "consequence": "Nach langer Recherche merkt ihr, dass ihr vielleicht ein paar zu viele Singeltons verwendet habt.",
        "effect": "Ein Teammitglied muss zwei ganze Tage und Nächte durcharbeiten, um alle Singletons umzuschreiben und braucht danach zwei Wochen Delfin-Therapie. Ihr habt temporär einen Storypoint weniger.",
        "cost": 2,
        "techDebt": 3,
        "positive": false,
        "effectType": "removeTemporary",
        "effectAmount": 1
    },
    {
        "type": "Bug",
        "frontend": false,
        "task": "Der API Endpoint eures Services hat zu viel Douglas Adams gelesen und gibt immer 42 zurück.",
        "consequence": "Nachdem ihr eure 'Keine Panik' Brillen abgesetzt habt, konnte ihr erfolgreich das Problem lösen.",
        "effect": "Eine mysteriöser Marvin wird euch für den nächsten Sprint zur Seite gestellt. Ihr seid noch etwas misstrauisch ob er ein Mensch oder eine Maschine ist - auf jeden Fall sehr trübsälig, trotzdem habt ihr für den nächsten Sprint 2 Storypoints mehr.",
        "cost": 3,
        "techDebt": 0,
        "positive": true,
        "effectType": "addTemporary",
        "effectAmount": 2
    },
    {
        "type": "Bug",
        "frontend": true,
        "task": "App lässt sich nicht mehr schließen, sobald das Passwort falsch eingegeben wurde.",
        "consequence": "Ihr müsst zwei eurer Geräte selbst wegschmeißen, da ihr die App nicht geschlossen bekommt. Dann behebt jemand endlich den Fehler.",
        "effect": "Nachdem Nutzende das Produkt endlich wieder richtig nutzen können, werden sie süchtig, finden dabei auch mehr Bugs und melden diese.",
        "cost": 2,
        "techDebt": 0,
        "positive": true,
        "effectType": "newBug",
        "effectAmount": 1
    },
    {
        "type": "Event",
        "number": 1,
        "title": "Neustart",
        "description": "Das Team ist hochmotiviert, ein neues Projekt zu starten, um die Welt ein Stückchen zu verbessern.",
        "effect": "Aufgrund eurer sprühenden Motivation habt ihr für den nächsten Sprint 2 Storypoints",
        "effectType": "addTemporary",
        "effectAmount": 2
    },
    {
        "type": "Event",
        "number": 2,
        "title": "Communication is key",
        "description": "Der Kunde und ihr redet viel aneinander vorbei. Scheint so, als müsstet ihr erst einmal ein BPMN bauen.",
        "effect": "Das bauen des BPMNs beansprucht im nächsten Sprint 2 Storypoints.",
        "effectType": "removeTemporary",
        "effectAmount": 2
    },
    {
        "type": "Event",
        "number": 3,
        "title": "Die Vergangenheit holt euch ein!",
        "description": "Jetzt ist euer Projekt endlich in Fahrt gekommen, nur was ist das? Die Library auf der ihr aufbaut scheint sich mit der aktuellsten Version eurer Programmiersprache nicht vereinbaren.",
        "effect": "Ihr müsst Gesicht voran in den Legacy Code diven und den Bug schleunigst beheben.",
        "effectType": "newBug",
        "effectAmount": 1
    },
    {
        "type": "Event",
        "number": 4,
        "title": "Positives Feedback!",
        "description": "Der Kunde ist zufrieden mit dem, was ihr bis jetzt erreicht habt.",
        "effect": "Das boostet eure Motivation für den nächsten Schritt, ihr könnt 4 Storypoints mehr abarbeiten.",
        "effectType": "addTemporary",
        "effectAmount": 4
    },
    {
        "type": "Event",
        "number": 5,
        "title": "Halbzeit",
        "description": "Ihr habt ungefähr die Hälfte eures Projektes verwirklicht. Die anfängliche Motivation stagniert langsam. Euer/Eure Scrum-Master:in verordnet einen Herr der Ringe Marathon im nächsten Sprint.",
        "effect": "Ihr schaut die Extended Edition, das kostet euch 4 Storypoints im nächsten Sprint.",
        "effectType": "removeTemporary",
        "effectAmount": 4
    },
    {
        "type": "Event",
        "number": 6,
        "title": "Big Tech kommt euch holen!",
        "description": "Ein Teammitgleid wurde von einem Big Tech abgeworben, schließlich haben sie einen Obstkorb.",
        "effect": "Ihr verliert dauerhaft 2 Storypoints",
        "effectType": "removePermanent",
        "effectAmount": 2
    },
    {
        "type": "Event",
        "number": 7,
        "title": "In the Summertime!",
        "description": "Kommen die Interns!",
        "effect": "Ein überambitionierter Intern zerschießt euch Production!",
        "effectType": "newBug",
        "effectAmount": 1
    },
    {
        "type": "Event",
        "number": 8,
        "title": "Entsprint!",
        "description": "Euer Budget wird noch einmal erhöht, damit ihr schneller fertig werdet.",
        "effect": "Für das restliche Projekt habt ihr 4 Storypoints mehr.",
        "effectType": "addPermanent",
        "effectAmount": 4
    },
    {
        "type": "Event",
        "number": 9,
        "title": "Spontante Kunden sind die schlimmsten!",
        "description": "'Auf einmal' ist dem Kunden ganz spontan aufgefallen, oh er bräuche ja unbedingt noch dieses eine Feature.",
        "effect": "Ihr bekommt ein neues Feature rein welches schnell noch umgesetzt werden soll.",
        "effectType": "newFeature",
        "effectAmount": 1
    },
    {
        "type": "Event",
        "number": 10,
        "title": "Sustainable Developement ist was Loser!",
        "description": "Noch ein Sprint und das Projekt muss stehen. Die Lehnen werden hochgestellt, die Trance Playlist zu Hard Tekke ausgetauscht und die Mate kühl gestellt.",
        "effect": "Koffein pulsiert in euren Adern, ihr könnt Farben riechen und schafft 6 Storypoints mehr.",
        "effectType": "addTemporary",
        "effectAmount": 6
    }
]